[
  {
    "id": "adversary-system",
    "term": "adversary system",
    "def": "Structure of litigation in which opposing parties present evidence and arguments before a neutral decision maker."
  },
  {
    "id": "administrative-law",
    "term": "administrative law",
    "def": "Body of law governing the creation, operation, and review of actions by administrative agencies."
  },
  {
    "id": "appellate-review",
    "term": "appellate review",
    "def": "Examination of a lower tribunal's decision by a higher court for legal error.",
    "aliases": ["appeal"]
  },
  {
    "id": "article-iii",
    "term": "Article III",
    "def": "Constitutional article establishing the federal judicial branch and defining the limits of federal judicial power."
  },
  {
    "id": "brief",
    "term": "brief",
    "def": "Written submission that explains a party's legal and factual arguments to a court."
  },
  {
    "id": "burden-of-proof",
    "term": "burden of proof",
    "def": "Obligation of a party to prove a fact or persuade the fact finder of a claim's validity."
  },
  {
    "id": "case-law",
    "term": "case law",
    "def": "Judicial decisions that interpret statutes, regulations, and constitutional provisions."
  },
  {
    "id": "certiorari",
    "term": "certiorari",
    "def": "Discretionary order by which the Supreme Court agrees to review a lower court's judgment."
  },
  {
    "id": "civil-procedure",
    "term": "civil procedure",
    "def": "Rules and statutes that govern the process of civil litigation from filing to judgment."
  },
  {
    "id": "common-law",
    "term": "common law",
    "def": "Judge-made law developed through precedent rather than enacted legislation."
  },
  {
    "id": "complaint",
    "term": "complaint",
    "def": "Initial pleading in a civil action that states the plaintiff's claims and requests relief."
  },
  {
    "id": "constitution",
    "term": "Constitution",
    "def": "Foundational legal charter establishing government structure and protecting individual rights."
  },
  {
    "id": "chevron-deference",
    "term": "Chevron deference",
    "def": "Doctrine requiring courts to defer to a reasonable agency interpretation of an ambiguous statute the agency administers."
  },
  {
    "id": "deference",
    "term": "deference",
    "def": "Judicial respect for the decisions or interpretations of another branch or decision maker."
  },
  {
    "id": "discovery",
    "term": "discovery",
    "def": "Pretrial process for obtaining evidence from other parties or nonparties."
  },
  {
    "id": "district-court",
    "term": "District Court",
    "def": "General federal trial court with original jurisdiction over civil and criminal matters."
  },
  {
    "id": "due-process",
    "term": "due process",
    "def": "Constitutional requirement that government procedures be fair and follow established rules."
  },
  {
    "id": "en-banc",
    "term": "en banc",
    "def": "Session in which a full appellate court, rather than a panel, hears and decides a case."
  },
  {
    "id": "equitable-relief",
    "term": "equitable relief",
    "def": "Nonmonetary remedy such as injunction, declaratory judgment, or specific performance."
  },
  {
    "id": "evidence",
    "term": "evidence",
    "def": "Testimony, documents, or tangible objects presented to prove or disprove facts at issue."
  },
  {
    "id": "federal-question",
    "term": "federal question",
    "def": "Claim arising under the Constitution, laws, or treaties of the United States."
  },
  {
    "id": "federalism",
    "term": "federalism",
    "def": "Constitutional division of authority between the federal government and the states."
  },
  {
    "id": "judicial-deference",
    "term": "judicial deference",
    "def": "Principle that courts give weight to coordinate branches or agencies when evaluating their actions or interpretations."
  },
  {
    "id": "judicial-review",
    "term": "judicial review",
    "def": "Authority of courts to invalidate government action that conflicts with the Constitution or governing law."
  },
  {
    "id": "final-judgment",
    "term": "final judgment rule",
    "def": "Doctrine limiting appellate review to decisions that resolve all claims for all parties."
  },
  {
    "id": "flow-of-case",
    "term": "case flow",
    "def": "Overall progression of a matter from investigation through final resolution."
  },
  {
    "id": "celotex",
    "term": "Celotex Corp. v. Catrett",
    "def": "1986 Supreme Court decision clarifying that summary judgment is appropriate when the nonmoving party lacks evidence on an essential element."
  },
  {
    "id": "holding",
    "term": "holding",
    "def": "Legal principle necessary to resolve the dispute before the court."
  },
  {
    "id": "injunction",
    "term": "injunction",
    "def": "Court order directing a party to do or refrain from doing a specific act."
  },
  {
    "id": "marbury-v-madison",
    "term": "Marbury v. Madison",
    "def": "1803 Supreme Court decision establishing the judiciary's power to review and invalidate unconstitutional government actions."
  },
  {
    "id": "brown-v-board",
    "term": "Brown v. Board of Education",
    "def": "1954 Supreme Court decision holding that racial segregation in public schools violates the Equal Protection Clause."
  },
  {
    "id": "jurisdiction",
    "term": "jurisdiction",
    "def": "Power of a court to hear and decide a case."
  },
  {
    "id": "legislative-history",
    "term": "legislative history",
    "def": "Materials generated during enactment of a statute that may inform interpretation."
  },
  {
    "id": "mens-rea",
    "term": "mens rea",
    "def": "Mental state required as an element of a crime, such as intent or knowledge."
  },
  {
    "id": "miranda-v-arizona",
    "term": "Miranda v. Arizona",
    "def": "1966 Supreme Court decision requiring warnings before custodial interrogation to protect the Fifth Amendment privilege."
  },
  {
    "id": "terry-v-ohio",
    "term": "Terry v. Ohio",
    "def": "1968 Supreme Court decision permitting brief investigatory stops and frisks based on reasonable suspicion."
  },
  {
    "id": "notice",
    "term": "notice",
    "def": "Information that informs a person of legal proceedings or obligations affecting them."
  },
  {
    "id": "original-jurisdiction",
    "term": "original jurisdiction",
    "def": "Authority of a court to hear a case in the first instance."
  },
  {
    "id": "personal-jurisdiction",
    "term": "personal jurisdiction",
    "def": "Court's power to render a judgment affecting a particular defendant's rights or obligations."
  },
  {
    "id": "exclusionary-rule",
    "term": "exclusionary rule",
    "def": "Judicially created remedy that suppresses evidence obtained in violation of constitutional rights."
  },
  {
    "id": "plea-bargain",
    "term": "plea bargain",
    "def": "Agreement in which a criminal defendant pleads guilty in exchange for concessions."
  },
  {
    "id": "precedent",
    "term": "precedent",
    "def": "Prior judicial decision that guides the outcome of later cases involving similar facts or law."
  },
  {
    "id": "probable-cause",
    "term": "probable cause",
    "def": "Reasonable ground to believe that a crime has been committed and that the suspect committed it.",
    "aliases": ["pc"]
  },
  {
    "id": "procedural-due-process",
    "term": "procedural due process",
    "def": "Requirement that the government follow fair procedures before depriving a person of life, liberty, or property."
  },
  {
    "id": "remand",
    "term": "remand",
    "def": "Order by an appellate court sending a case back to a lower court for further proceedings."
  },
  {
    "id": "remedies",
    "term": "remedies",
    "def": "Legal or equitable relief provided to address a violation of rights."
  },
  {
    "id": "daubert",
    "term": "Daubert standard",
    "def": "Test for admitting expert testimony that examines methodology, testing, error rates, and peer review."
  },
  {
    "id": "ebay-v-mercexchange",
    "term": "eBay v. MercExchange",
    "def": "2006 Supreme Court case articulating the four-factor test for permanent injunctions that applies across equity."
  },
  {
    "id": "rule-of-law",
    "term": "rule of law",
    "def": "Principle that government officials and citizens are bound by and accountable to the law."
  },
  {
    "id": "service-of-process",
    "term": "service of process",
    "def": "Formal delivery of legal documents to notify a party of proceedings."
  },
  {
    "id": "stare-decisis",
    "term": "stare decisis",
    "def": "Doctrine requiring courts to follow controlling precedent absent a compelling reason to depart."
  },
  {
    "id": "statute",
    "term": "statute",
    "def": "Law enacted by a legislature and codified in the United States Code or state code."
  },
  {
    "id": "subject-matter",
    "term": "subject-matter jurisdiction",
    "def": "Authority of a court to hear cases of a particular type or category."
  },
  {
    "id": "supreme-court",
    "term": "Supreme Court",
    "def": "Highest court in the United States with final authority over federal law and the Constitution."
  },
  {
    "id": "suppression",
    "term": "suppression",
    "def": "Exclusion of evidence obtained in violation of constitutional or statutory rights."
  },
  {
    "id": "venue",
    "term": "venue",
    "def": "Proper geographic location for a court to hear a case."
  },
  {
    "id": "voir-dire",
    "term": "voir dire",
    "def": "Process of questioning prospective jurors to assess qualifications and impartiality."
  },
  {
    "id": "writ",
    "term": "writ",
    "def": "Formal written order issued by a court directing a specific action."
  }
]
