[
  {
    "id": "adversary-system",
    "term": "adversary system",
    "def": "Structure of U.S. litigation in which opposing parties present evidence and arguments before a neutral decision maker."
  },
  {
    "id": "administrative-agency",
    "term": "administrative agency",
    "def": "Government entity created by statute to implement, enforce, and sometimes adjudicate regulatory programs."
  },
  {
    "id": "administrative-law",
    "term": "administrative law",
    "def": "Body of law governing the creation, operation, and review of agency rules, orders, and adjudications."
  },
  {
    "id": "amicus-curiae",
    "term": "amicus curiae",
    "def": "Nonparty who submits a brief to assist a court in deciding important issues, often in appellate litigation."
  },
  {
    "id": "amendment",
    "term": "amendment",
    "def": "Formal change to a constitution or statute adopted through prescribed legislative or popular procedures."
  },
  {
    "id": "appellate-court",
    "term": "appellate court",
    "def": "Court that reviews decisions of lower tribunals for legal error rather than hearing evidence anew."
  },
  {
    "id": "appellate-review",
    "term": "appellate review",
    "def": "Examination of a lower tribunal's judgment by a higher court with power to affirm, reverse, or modify the result.",
    "aliases": ["appeal"]
  },
  {
    "id": "article-i",
    "term": "Article I",
    "def": "Constitutional article establishing the legislative branch and enumerating Congress's powers."
  },
  {
    "id": "article-iii",
    "term": "Article III",
    "def": "Constitutional article establishing the federal judicial branch and defining the limits of federal judicial power."
  },
  {
    "id": "bill",
    "term": "bill",
    "def": "Proposed statute introduced in a legislative body for debate, amendment, and enactment."
  },
  {
    "id": "burden-of-proof",
    "term": "burden of proof",
    "def": "Obligation of a party to produce evidence or persuade the fact finder regarding a disputed issue."
  },
  {
    "id": "case-law",
    "term": "case law",
    "def": "Judicial decisions that interpret statutes, regulations, and constitutional provisions, forming precedent."
  },
  {
    "id": "certiorari",
    "term": "certiorari",
    "def": "Discretionary order by which the Supreme Court or another high court agrees to review a lower court's judgment."
  },
  {
    "id": "civil-procedure",
    "term": "civil procedure",
    "def": "Rules and statutes that govern the process of civil litigation from filing through judgment and appeal."
  },
  {
    "id": "complaint",
    "term": "complaint",
    "def": "Initial pleading in a civil action that states the plaintiff's claims, facts, and request for relief."
  },
  {
    "id": "concurrent-jurisdiction",
    "term": "concurrent jurisdiction",
    "def": "Situation in which more than one court system is authorized to hear the same type of case."
  },
  {
    "id": "congress",
    "term": "Congress",
    "def": "Federal legislative body composed of the House of Representatives and the Senate."
  },
  {
    "id": "consideration",
    "term": "consideration",
    "def": "Something of value exchanged between contracting parties that makes a promise legally enforceable."
  },
  {
    "id": "constitutional-avoidance",
    "term": "constitutional avoidance",
    "def": "Judicial principle counseling courts to decide cases on nonconstitutional grounds when possible."
  },
  {
    "id": "constitutional-law",
    "term": "constitutional law",
    "def": "Study of governmental structure, individual rights, and the interpretation of constitutional text."
  },
  {
    "id": "constitution",
    "term": "Constitution",
    "def": "Foundational legal charter establishing government structure, allocating powers, and protecting rights."
  },
  {
    "id": "court-of-appeals",
    "term": "court of appeals",
    "def": "Intermediate federal appellate court reviewing decisions from district courts and certain agencies."
  },
  {
    "id": "damages",
    "term": "damages",
    "def": "Monetary compensation awarded to remedy a legal wrong or injury."
  },
  {
    "id": "declaratory-judgment",
    "term": "declaratory judgment",
    "def": "Court order that clarifies the rights and obligations of parties without awarding damages or coercive relief."
  },
  {
    "id": "discovery",
    "term": "discovery",
    "def": "Pretrial process for obtaining evidence and information from other parties or nonparties."
  },
  {
    "id": "district-court",
    "term": "District Court",
    "def": "General federal trial court with original jurisdiction over civil and criminal matters."
  },
  {
    "id": "due-process",
    "term": "due process",
    "def": "Constitutional requirement that government procedures be fair and follow established rules."
  },
  {
    "id": "equal-protection",
    "term": "equal protection",
    "def": "Constitutional guarantee that similarly situated individuals will not be treated differently without sufficient justification."
  },
  {
    "id": "equitable-relief",
    "term": "equitable relief",
    "def": "Nonmonetary remedy such as injunction, declaratory judgment, or specific performance."
  },
  {
    "id": "evidence",
    "term": "evidence",
    "def": "Testimony, documents, or tangible objects presented to prove or disprove facts at issue."
  },
  {
    "id": "executive-order",
    "term": "executive order",
    "def": "Directive issued by the President or a governor that manages operations of the executive branch."
  },
  {
    "id": "federal-question",
    "term": "federal question",
    "def": "Claim arising under the Constitution, laws, or treaties of the United States."
  },
  {
    "id": "federalism",
    "term": "federalism",
    "def": "Constitutional division of authority between the federal government and the states."
  },
  {
    "id": "hearing",
    "term": "hearing",
    "def": "Formal proceeding where a decision maker receives evidence and argument on a disputed matter."
  },
  {
    "id": "injunction",
    "term": "injunction",
    "def": "Court order directing a party to do or refrain from doing a specific act."
  },
  {
    "id": "judicial-opinion",
    "term": "judicial opinion",
    "def": "Written explanation of a court's decision and the legal reasoning supporting it."
  },
  {
    "id": "judicial-review",
    "term": "judicial review",
    "def": "Authority of courts to invalidate government action that conflicts with the Constitution or governing law."
  },
  {
    "id": "jurisdiction",
    "term": "jurisdiction",
    "def": "Legal authority of a court to hear and decide a case, often limited by subject matter or geography."
  },
  {
    "id": "legislative-history",
    "term": "legislative history",
    "def": "Committee reports, debates, and other materials generated during the enactment of a statute."
  },
  {
    "id": "majority-opinion",
    "term": "majority opinion",
    "def": "Opinion joined by most judges on a panel, establishing the court's binding decision."
  },
  {
    "id": "mandamus",
    "term": "mandamus",
    "def": "Extraordinary writ ordering a government official to perform a ministerial duty."
  },
  {
    "id": "mootness",
    "term": "mootness",
    "def": "Doctrine preventing courts from deciding cases when events have resolved the dispute or relief is impossible."
  },
  {
    "id": "ordinance",
    "term": "ordinance",
    "def": "Law enacted by a municipal government such as a city or county council."
  },
  {
    "id": "original-jurisdiction",
    "term": "original jurisdiction",
    "def": "Authority of a court to hear a case in the first instance."
  },
  {
    "id": "personal-jurisdiction",
    "term": "personal jurisdiction",
    "def": "Court's power to render a judgment affecting a particular defendant's rights or obligations."
  },
  {
    "id": "pleading",
    "term": "pleading",
    "def": "Formal written statement of a party's claims or defenses filed in court."
  },
  {
    "id": "precedent",
    "term": "precedent",
    "def": "Prior judicial decision that guides the outcome of later cases involving similar facts or law."
  },
  {
    "id": "preemption",
    "term": "preemption",
    "def": "Doctrine under which federal law displaces conflicting state law."
  },
  {
    "id": "probable-cause",
    "term": "probable cause",
    "def": "Reasonable ground to believe that a crime has been committed and that the suspect committed it.",
    "aliases": ["pc"]
  },
  {
    "id": "procedural-due-process",
    "term": "procedural due process",
    "def": "Requirement that the government follow fair procedures before depriving a person of life, liberty, or property."
  },
  {
    "id": "public-defender",
    "term": "public defender",
    "def": "Government-paid attorney who represents criminal defendants unable to afford counsel."
  },
  {
    "id": "remand",
    "term": "remand",
    "def": "Order by an appellate court sending a case back to a lower court for further proceedings."
  },
  {
    "id": "remedies",
    "term": "remedies",
    "def": "Legal or equitable relief provided to address a violation of rights."
  },
  {
    "id": "rule-of-law",
    "term": "rule of law",
    "def": "Principle that government officials and citizens are bound by and accountable to the law."
  },
  {
    "id": "separation-of-powers",
    "term": "separation of powers",
    "def": "Constitutional allocation of legislative, executive, and judicial functions among distinct branches."
  },
  {
    "id": "standing",
    "term": "standing",
    "def": "Requirement that a litigant suffer a concrete injury fairly traceable to the defendant and likely redressable by the court."
  },
  {
    "id": "stare-decisis",
    "term": "stare decisis",
    "def": "Doctrine requiring courts to follow controlling precedent absent a compelling reason to depart."
  },
  {
    "id": "statute",
    "term": "statute",
    "def": "Law enacted by a legislature and codified in the United States Code or state code."
  },
  {
    "id": "subject-matter-jurisdiction",
    "term": "subject-matter jurisdiction",
    "def": "Authority of a court to hear cases of a particular type or category."
  },
  {
    "id": "subpoena",
    "term": "subpoena",
    "def": "Court order requiring a person to provide testimony or documents."
  },
  {
    "id": "summary-judgment",
    "term": "summary judgment",
    "def": "Procedural device allowing a court to resolve a case without trial when no material fact is disputed and the movant is entitled to judgment as a matter of law."
  },
  {
    "id": "supreme-court",
    "term": "Supreme Court",
    "def": "Highest court in the United States with final authority over federal law and the Constitution."
  },
  {
    "id": "supremacy-clause",
    "term": "Supremacy Clause",
    "def": "Article VI provision declaring the Constitution and federal laws the supreme law of the land."
  },
  {
    "id": "trial-court",
    "term": "trial court",
    "def": "Court that hears evidence, determines facts, and enters judgment in the first instance."
  },
  {
    "id": "venue",
    "term": "venue",
    "def": "Proper geographic location for a court to hear a case."
  },
  {
    "id": "writ",
    "term": "writ",
    "def": "Formal written order issued by a court directing a specific action."
  }
]
